{
  "personalInfo": {
    "name": "René Lázaro Collado Arteaga",
    "title": "Full Stack Developer",
    "email": "renearteaga261998@gmail.com",
    "location": "Habana, Cuba",
    "summary": "Desarrollador web especializado en el Backend con más de dos años de experiencia en el desarrollo de aplicaciones web y un fuerte interés en la arquitectura y el diseño de software. Capaz de trabajar en equipo o de manera independiente, con gran capacidad de análisis y resolución de problemas. Experiencia en el desarrollo de aplicaciones web usando Django Rest Framework, Flask y su unión con tecnologías frontend como Vue."
  },
  "contact": {
    "email": "renearteaga261998@gmail.com",
    "phone": "+5351251511",
    "linkedin": "www.linkedin.com/in/rene-lazaro-collado-arteaga-447335245",
    "github": "https://github.com/critBus",
    "location": "Habana, Cuba"
  },
  "experience": [
    {
      "id": 1,
      "company": "Company Name",
      "position": "Position Title",
      "startDate": "2023-01",
      "endDate": "Present",
      "description": "Description of your role and achievements",
      "technologies": [
        "Tech1",
        "Tech2",
        "Tech3"
      ]
    }
  ],
  "projects": {
    "Django": [
      {
        "id": 1,
        "name": "IAEstadosDeMaduracion",
        "description": [
          "IAEstadosDeMaduracion es una plataforma web completa en Django, diseñada para proporcionar una plataforma de entrenamiento de sistemas de visión por computadoras basados en redes convolucionales. Esta herramienta permite a los usuarios almacenar y gestionar datasets de imágenes de frutos, que posteriormente pueden ser utilizados para el entrenamiento de una red neuronal convolucional.",
          "La interfaz de esta plataforma web es muy cómoda y ofrece múltiples opciones de configuración para el entrenamiento de la red neuronal. Estas opciones permiten limitar el número máximo de épocas para el entrenamiento, almacenar solo el mejor modelo obtenido y detener el entrenamiento al alcanzar cierto límite de precisión. Durante el proceso de entrenamiento, IA Estados de Maduración proporciona gráficos que muestran la estadística del progreso, como la precisión y la pérdida.",
          "Al finalizar el entrenamiento, se muestra una matriz de confusión que presenta la precisión real del modelo neuronal resultante. Una vez que se han creado varios modelos neuronales para diferentes tipos de frutos, la plataforma permite a los usuarios clasificar automáticamente sus imágenes utilizando el modelo neuronal que mejor precisión haya alcanzado para su tipo de fruto. Esta herramienta es una excelente opción para evaluar la calidad de los sembrados de campos agrícolas, ya que no se requiere sacrificar una parte de la producción en el proceso. Es una herramienta útil para científicos, agricultores y cualquier persona interesada en clasificar imágenes de frutos según sus estados de madurez."
        ],
        "technologies": [
          "Django",
          "PostgreSQL",
          "IA",
          "Tensorflow",
          "Keras",
          "HTML",
          "CSS",
          "JavaScript",
          "Bootstrap"
        ],
        "link": "",
        "demo": ""
      }
    ],
    "Python": [],
    "Java": []
  },
  "education": [
    {
      "id": 1,
      "institution": "University Name",
      "degree": "Your Degree",
      "field": "Your Field",
      "startDate": "2018",
      "endDate": "2022"
    }
  ],
  "skills": {
    "Programación": [
      "JavaScript",
      "TypeScript",
      "Python",
      "Java",
      "C#"
    ],
    "Frameworks": [
      "React",
      "Next.js",
      "Node.js",
      "Django Rest Framework",
      "Flask"
    ],
    "Herramientas": [
      "Git",
      "Github",
      "Docker"
    ],
    "Bases de Datos": [
      "PostgreSQL",
      "SQLServer",
      "Neo4j"
    ]
  }
}